s = '''
The Zen of Python, by Tim Peters

아름다운 것이 추한 것보다 낫다.
명시적인 것이 암시적인 것보다 낫다.
단순한 것이 복잡한 것보다 낫다.
복잡한 것이 난해한 것보다 낫다.
수평적인 것이 계층적인 것보다 낫다.
여유로운 것이 밀집한 것보다 낫다.
가독성은 중요하다.
특별한 경우라도 규칙을 어길 만큼 특별하진 않다.
실용성은 순수성에 우선한다.
오류는 결코 조용히 넘어가지 말아야 한다.
명시적으로 오류를 감추려는 경우는 예외다.
모호함을 마주하면 추측하려는 유혹을 거부하라.
문제를 해결할 명확한 방법은 하나 뿐이어야 한다.
그 방법이 처음에는 명확해 보이지 않을 수 있다(네덜란드 사람이 아니라면).
지금 하는 것이 아예 안 하는 것보다 낫다.
하지만 지금 당장 하는 것보다 안 하는 게 나을 때도 있다.
구현 설명이 어렵다면 좋은 아이디어가 아니다.
구현 설명이 쉽다면 좋은 아이디어일 수 있다.
네임스페이스는 정말 훌륭한 아이디어다. 더 많이 사용하자!
'''

print(s)
